---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.TransactionFailedWarn
source: html/87b08f87-6c4a-054d-1ff1-1bed4ee9db62.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.TransactionFailedWarn Property

[Description]

## Syntax (C#)
```csharp
public static FailureDefinitionId TransactionFailedWarn { get; }
```